src/main/java/ok/dht/test/yasevich/profiling/stage6/wrk/v2/range100-rate10000
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 1.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.062ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.049ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.057ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.048ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.37ms   14.55ms 179.58ms   92.35%
    Req/Sec     0.89k   552.45    11.33k    87.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.44ms
 90.000%   10.74ms
 99.000%   72.64ms
 99.900%  125.25ms
 99.990%  161.28ms
 99.999%  173.57ms
100.000%  179.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.085     0.000000            1         1.00
       0.416     0.100000        33610         1.11
       0.568     0.200000        67178         1.25
       0.706     0.300000       100655         1.43
       0.841     0.400000       134362         1.67
       0.974     0.500000       167796         2.00
       1.044     0.550000       184621         2.22
       1.109     0.600000       201434         2.50
       1.176     0.650000       218235         2.86
       1.269     0.700000       234814         3.33
       1.442     0.750000       251628         4.00
       1.612     0.775000       259972         4.44
       2.003     0.800000       268335         5.00
       2.893     0.825000       276719         5.71
       4.515     0.850000       285107         6.67
       6.927     0.875000       293489         8.00
       8.567     0.887500       297688         8.89
      10.743     0.900000       301874        10.00
      14.447     0.912500       306062        11.43
      20.799     0.925000       310256        13.33
      29.039     0.937500       314447        16.00
      33.503     0.943750       316546        17.78
      38.335     0.950000       318656        20.00
      43.103     0.956250       320743        22.86
      47.839     0.962500       322840        26.67
      52.447     0.968750       324931        32.00
      54.783     0.971875       325977        35.56
      57.279     0.975000       327029        40.00
      59.743     0.978125       328071        45.71
      62.399     0.981250       329121        53.33
      65.439     0.984375       330174        64.00
      67.071     0.985938       330702        71.11
      68.927     0.987500       331230        80.00
      71.231     0.989062       331748        91.43
      73.727     0.990625       332267       106.67
      76.927     0.992188       332792       128.00
      78.847     0.992969       333050       142.22
      80.959     0.993750       333314       160.00
      83.455     0.994531       333576       182.86
      86.271     0.995313       333836       213.33
      89.791     0.996094       334098       256.00
      91.903     0.996484       334233       284.44
      94.079     0.996875       334362       320.00
      96.703     0.997266       334494       365.71
      99.647     0.997656       334622       426.67
     104.127     0.998047       334754       512.00
     107.519     0.998242       334820       568.89
     110.911     0.998437       334884       640.00
     115.391     0.998633       334952       731.43
     120.255     0.998828       335015       853.33
     125.823     0.999023       335081      1024.00
     128.255     0.999121       335114      1137.78
     131.327     0.999219       335146      1280.00
     134.143     0.999316       335183      1462.86
     136.959     0.999414       335212      1706.67
     139.007     0.999512       335246      2048.00
     140.799     0.999561       335262      2275.56
     142.975     0.999609       335279      2560.00
     144.127     0.999658       335294      2925.71
     146.559     0.999707       335310      3413.33
     149.631     0.999756       335327      4096.00
     151.679     0.999780       335335      4551.11
     153.343     0.999805       335344      5120.00
     155.135     0.999829       335351      5851.43
     157.823     0.999854       335360      6826.67
     160.383     0.999878       335369      8192.00
     161.151     0.999890       335372      9102.22
     161.535     0.999902       335376     10240.00
     163.199     0.999915       335380     11702.86
     164.351     0.999927       335384     13653.33
     164.991     0.999939       335388     16384.00
     165.631     0.999945       335390     18204.44
     165.759     0.999951       335392     20480.00
     165.887     0.999957       335394     23405.71
     166.783     0.999963       335396     27306.67
     167.935     0.999969       335398     32768.00
     168.831     0.999973       335399     36408.89
     168.959     0.999976       335400     40960.00
     169.727     0.999979       335401     46811.43
     169.983     0.999982       335402     54613.33
     170.239     0.999985       335403     65536.00
     171.391     0.999986       335404     72817.78
     171.391     0.999988       335404     81920.00
     173.567     0.999989       335405     93622.86
     173.567     0.999991       335405    109226.67
     174.719     0.999992       335406    131072.00
     174.719     0.999993       335406    145635.56
     174.719     0.999994       335406    163840.00
     176.383     0.999995       335407    187245.71
     176.383     0.999995       335407    218453.33
     176.383     0.999996       335407    262144.00
     176.383     0.999997       335407    291271.11
     176.383     0.999997       335407    327680.00
     179.711     0.999997       335408    374491.43
     179.711     1.000000       335408          inf
#[Mean    =        5.372, StdDeviation   =       14.546]
#[Max     =      179.584, Total count    =       335408]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  435659 requests in 1.00m, 1.43GB read
  Socket errors: connect 0, read 0, write 0, timeout 480
Requests/sec:   7261.02
Transfer/sec:     24.41MB