src/main/java/ok/dht/test/yasevich/profiling/stage6/wrk/v2/range100-rate15000
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 4.092ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.138ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.099ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.785ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.777ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.102ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.823ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.690ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.75ms   25.70ms 298.24ms   91.00%
    Req/Sec     1.17k     0.88k   18.44k    87.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    2.95ms
 90.000%   28.53ms
 99.000%  131.20ms
 99.900%  217.09ms
 99.990%  259.07ms
 99.999%  291.58ms
100.000%  298.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.089     0.000000            1         1.00
       0.452     0.100000        44156         1.11
       0.621     0.200000        88099         1.25
       0.772     0.300000       132069         1.43
       0.920     0.400000       176216         1.67
       1.067     0.500000       220142         2.00
       1.142     0.550000       242049         2.22
       1.229     0.600000       263935         2.50
       1.361     0.650000       285999         2.86
       1.661     0.700000       307921         3.33
       2.949     0.750000       329909         4.00
       4.211     0.775000       340928         4.44
       5.919     0.800000       351903         5.00
       8.167     0.825000       362899         5.71
      11.327     0.850000       373915         6.67
      17.167     0.875000       384889         8.00
      21.919     0.887500       390397         8.89
      28.527     0.900000       395887        10.00
      37.375     0.912500       401394        11.43
      45.791     0.925000       406884        13.33
      54.623     0.937500       412392        16.00
      59.551     0.943750       415149        17.78
      64.543     0.950000       417880        20.00
      69.631     0.956250       420633        22.86
      75.519     0.962500       423377        26.67
      82.559     0.968750       426148        32.00
      86.527     0.971875       427507        35.56
      90.943     0.975000       428878        40.00
      95.999     0.978125       430250        45.71
     101.823     0.981250       431632        53.33
     109.439     0.984375       433004        64.00
     113.919     0.985938       433687        71.11
     119.359     0.987500       434375        80.00
     126.271     0.989062       435062        91.43
     134.143     0.990625       435752       106.67
     142.335     0.992188       436441       128.00
     146.943     0.992969       436778       142.22
     151.935     0.993750       437125       160.00
     157.823     0.994531       437466       182.86
     165.759     0.995313       437810       213.33
     174.719     0.996094       438153       256.00
     179.199     0.996484       438328       284.44
     183.935     0.996875       438497       320.00
     189.439     0.997266       438673       365.71
     194.303     0.997656       438840       426.67
     200.319     0.998047       439014       512.00
     203.263     0.998242       439098       568.89
     206.335     0.998437       439183       640.00
     209.791     0.998633       439272       731.43
     213.375     0.998828       439355       853.33
     217.983     0.999023       439441      1024.00
     220.031     0.999121       439484      1137.78
     223.615     0.999219       439529      1280.00
     226.815     0.999316       439572      1462.86
     230.399     0.999414       439614      1706.67
     234.623     0.999512       439656      2048.00
     236.543     0.999561       439678      2275.56
     238.335     0.999609       439699      2560.00
     241.023     0.999658       439720      2925.71
     244.095     0.999707       439745      3413.33
     246.655     0.999756       439765      4096.00
     248.319     0.999780       439774      4551.11
     249.983     0.999805       439785      5120.00
     251.775     0.999829       439795      5851.43
     253.695     0.999854       439806      6826.67
     255.743     0.999878       439817      8192.00
     257.279     0.999890       439822      9102.22
     259.967     0.999902       439828     10240.00
     263.167     0.999915       439833     11702.86
     265.471     0.999927       439839     13653.33
     268.031     0.999939       439844     16384.00
     268.799     0.999945       439846     18204.44
     270.079     0.999951       439849     20480.00
     272.127     0.999957       439852     23405.71
     274.687     0.999963       439854     27306.67
     278.271     0.999969       439858     32768.00
     278.271     0.999973       439858     36408.89
     279.295     0.999976       439860     40960.00
     279.807     0.999979       439861     46811.43
     280.831     0.999982       439862     54613.33
     287.487     0.999985       439864     65536.00
     287.487     0.999986       439864     72817.78
     289.791     0.999988       439865     81920.00
     291.583     0.999989       439866     93622.86
     291.583     0.999991       439866    109226.67
     294.655     0.999992       439867    131072.00
     294.655     0.999993       439867    145635.56
     295.167     0.999994       439868    163840.00
     295.167     0.999995       439868    187245.71
     295.167     0.999995       439868    218453.33
     296.703     0.999996       439869    262144.00
     296.703     0.999997       439869    291271.11
     296.703     0.999997       439869    327680.00
     296.703     0.999997       439869    374491.43
     296.703     0.999998       439869    436906.67
     298.495     0.999998       439870    524288.00
     298.495     1.000000       439870          inf
#[Mean    =        9.751, StdDeviation   =       25.697]
#[Max     =      298.240, Total count    =       439870]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  585704 requests in 1.00m, 1.92GB read
  Socket errors: connect 0, read 0, write 0, timeout 624
Requests/sec:   9761.77
Transfer/sec:     32.70MB